app/Controllers/RegisterController.php

public function createlogin(){
    $response = ['status' => false, 'message' => ''];

    if ($this->request->isAJAX()) {


        $email=$this->request->getVar('email');
        $password=$this->request->getVar('password');

        $userModel = new RegisterModel();
        $validationRules = [
           'email'     => 'required|valid_email',
           'password'   => 'required|min_length[6]',

        ];

        if (!$this->validate($validationRules)) {
            return $this->response->setJSON(['status' => 'error', 'errors' => $this->validator->getErrors()]);
        }
        $user=$userModel->where('email',$email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'komal@gmail.com'
 LIMIT 1